<?xml version="1.0" encoding="UTF-8"?>
<Section>
                <Heading>Gaps</Heading>
                A <E>gap</E> of a numerical semigroup <M>S</M> is a nonnegative integer not belonging to 
<M>S</M>. 
The <E>fundamental gaps</E> of <M>S</M> are those gaps that are maximal with respect to the partial order induced by 
division in <M>{\mathbb N}</M>.

The <E>special gaps</E> of a numerical semigroup <M>S</M>, are 
those fundamental gaps such that if they are added to the given numerical semigroup, 
then the resulting set is again a numerical semigroup.

                <ManSection>
                    <Attr Name="GapsOfNumericalSemigroup" Arg="NS"/>
                    <Description>
                        <C>NS</C> 
                        is a numerical semigroup. It returns the set of gaps of <C>NS</C>.
                        <Example><![CDATA[
gap> GapsOfNumericalSemigroup(NumericalSemigroup(3,5,7));
[ 1, 2, 4 ]
]]></Example>
                    </Description>
                </ManSection>

		<ManSection>
		  <Attr Name="LatticePathAssociatedToNumericalSemigroup" Arg="S,p,q"/>
		    <Description>
		      <C>S</C> is a numerical semigroup and <C>p,q</C> are two elements in <C>S</C>.
		      <P/>In this setting <C>S</C> is an oversemigroup of <M>\langle p,q\rangle</M>, and consequently evey gap of <C>S</C> is a gap of <M>\langle p,q\rangle</M>. If <M>c</M> is teh conductor of <M>\langle p,q\rangle</M>, then every gap <M>g</M> of <M>\langle p,q\rangle</M> can be written uniquely as <M>g=c-1-(ap+bp)</M> for some nonnegative integers <M>a,b</M>. We say that <M>(a,b)</M> are the coordinates associated to <M>g</M>.

		      <P/> The output is a path in <M>\mathbb{N}^2</M> such that coordinates of the gaps of <M>S</M> correspond exactly with the points in <M>\mathbb{N}^2</M> that are between the path en the line <M>ax+by=c-1</M>. See <Cite Key="K-W"></Cite>.
                        <Example><![CDATA[
gap> s:=NumericalSemigroup(16,17,71,72);;
gap> LatticePathAssociatedToNumericalSemigroup(s,16,17);
[ [ 0, 14 ], [ 1, 13 ], [ 2, 12 ], [ 3, 11 ], [ 4, 10 ], [ 5, 9 ], [ 6, 8 ], 
  [ 7, 7 ], [ 8, 6 ], [ 9, 5 ], [ 10, 4 ], [ 11, 3 ], [ 12, 2 ], [ 13, 1 ], 
  [ 14, 0 ] ]
]]></Example>

		    </Description>
		</ManSection>
		
                <ManSection>
                    <Attr Name="GenusOfNumericalSemigroup" Arg="NS"/>
                    <Description>
                        <C>NS</C> 
                        is a numerical semigroup. It returns the number of  gaps of <C>NS</C>.
                    </Description>
                </ManSection>
                
                
                <ManSection>
                    <Attr Name="FundamentalGapsOfNumericalSemigroup" Arg="S"/>
                    <Description>
                        <C>S</C> 
                        is a numerical semigroup. It returns the set of fundamental gaps of <A>S</A>.
                        <Example><![CDATA[
gap> S := NumericalSemigroup("modular", 5,53);
<Modular numerical semigroup satisfying 5x mod 53 <= x >
gap> FundamentalGapsOfNumericalSemigroup(S);
[ 16, 17, 18, 19, 27, 28, 29, 30, 31, 40, 41, 42 ]
gap> GapsOfNumericalSemigroup(S);
[ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14, 15, 16, 17, 18, 19, 20, 21, 27, 28, 29,
  30, 31, 40, 41, 42 ]
]]></Example>
                    </Description>
                </ManSection>
                
                
                <ManSection>
                    <Attr Name="SpecialGapsOfNumericalSemigroup" Arg="S"/>
                    <Description>
                        <C>S</C> 
                        is a numerical semigroup. It returns the special gaps of <A>S</A>.
                        
                        <Example><![CDATA[
gap> S := NumericalSemigroup("modular", 5,53);
<Modular numerical semigroup satisfying 5x mod 53 <= x >
gap> SpecialGapsOfNumericalSemigroup(S);
[ 40, 41, 42 ]
]]></Example>
                    </Description>
                </ManSection>
            </Section>
