<?xml version="1.0" encoding="UTF-8"?>
<Section>
  <Heading>Presentations of Numerical Semigroups</Heading>
  
  <ManSection>
    
    <Func Arg="S" Name="MinimalPresentationOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      
      The output is a list of lists with two elements. Each list of two elements represents
      a relation between the minimal generators of the numerical semigroup. If 
      <M> \{ \{x_1,y_1\},\ldots,\{x_k,y_k\}\} </M> is the output
      and <M> \{m_1,\ldots,m_n\} </M> is the minimal system of generators 
      of the numerical semigroup, then
      <M> \{x_i,y_i\}=\{\{a_{i_1},\ldots,a_{i_n}\},\{b_{i_1},\ldots,b_{i_n}\}\}</M>
      and <M> a_{i_1}m_1+\cdots+a_{i_n}m_n= b_{i_1}m_1+ \cdots +b_{i_n}m_n.</M>
      <P/>
      
      Any other relation among the minimal generators of the semigroup can be deduced from 
      the ones given in the output.
      <P/>
      
      The algorithm implemented is described in <Cite Key="Ros96"></Cite>
      (see also  <Cite Key="RGS99"></Cite>).
      
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);
      <Numerical semigroup with 3 generators>
      gap> MinimalPresentationOfNumericalSemigroup(s);
      [ [ [ 0, 2, 0 ], [ 1, 0, 1 ] ], [ [ 3, 1, 0 ], [ 0, 0, 2 ] ], 
      [ [ 4, 0, 0 ], [ 0, 1, 1 ] ] ]
      ]]>
      </Example>          
      The first element in the list means that <M> 1\times 3+1\times 7=2\times 5 </M>,
      and the others have similar meanings.
      
    </Description>
  </ManSection>
  
  <ManSection>
    <Func Arg="n, S" Name="GraphAssociatedToElementInNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup and <A>n</A> is an element in <A>S</A>.
      <P/>
      The output is a pair. If <M> \{m_1,\ldots,m_n\} </M> is the set of minimal 
      generators of <A>S</A>, then the first component is the set of vertices of the graph 
      associated to <A>n</A> in <A>S</A>, that is, the set 
      <M>\{ m_i \ |\  n-m_i\in S\} </M>, 
      and the second component is the set of edges of this graph, that is,
      <M> \{ \{m_i,m_j\} \ |\  n-(m_i+m_j)\in S\}.</M>
      
      <P/>
      This function is used to compute a minimal presentation of the numerical semigroup
      <A>S</A>, as explained in <Cite Key="Ros96"></Cite>. 
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);;
      gap> GraphAssociatedToElementInNumericalSemigroup(10,s);
      [ [ 3, 5, 7 ], [ [ 3, 7 ] ] ]
      ]]>
      </Example>          
      
      
    </Description>
  </ManSection>

  <ManSection>
    <Func Arg="S" Name="BettiElementsOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is the set of elements in <A>S</A> whose associated graph is nonconnected <Cite Key="GS-O"></Cite>.
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);;
      gap> BettiElementsOfNumericalSemigroup(s);
      [ 10, 12, 14 ]
      ]]>
      </Example>          
      
      
    </Description>
  </ManSection>

  <ManSection>
    <Func Arg="S" Name="PrimitiveElementsOfNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is the set of elements <M>s</M> in <A>S</A> such that  there exists a minimal  solution to <M>msg\cdot x-msg\cdot y = 0</M>,  such that <M>x,y</M> are factorizations of <M>s</M>, and <M>msg</M> is the minimal generating system of <A>S</A>. Betti elements are primitive, but not the way around in general.
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);;
      gap> PrimitiveElementsOfNumericalSemigroup(s);
      [ 3, 5, 7, 10, 12, 14, 15, 21, 28, 35 ]
      ]]>
      </Example>          
      
      
    </Description>
  </ManSection>


  <ManSection Label="shadedset">
    <Func Arg="n, S" Name="ShadedSetOfElementInNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup and <A>n</A> is an element in <A>S</A>.
      
      <P/>
      The output is a simplicial complex <M>C</M>. If <M> \{m_1,\ldots,m_n\} </M> is the set of minimal 
      generators of <A>S</A>, then <M>L \in C</M> if 
      <M>n-\sum_{i\in L} m_i\in S</M> (<Cite Key="SzW"></Cite>).                        
      <P/>
      This function is a generalization of the graph associated to <A>n</A>. 
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);;
      gap> ShadedSetOfElementInNumericalSemigroup(10,s);
      [ [  ], [ 3 ], [ 3, 7 ], [ 5 ], [ 7 ] ]
      ]]>
      </Example>          
      
      
    </Description>
  </ManSection>
</Section>


<Section>
  <Heading>Uniquely Presented Numerical Semigroups</Heading>

  A numerical semigroup <M>S</M> is uniquely presented if for any two minimal presentations <M>\sigma</M> and <M>\tau</M> and any <M>(a,b)\in \sigma</M>, either <M>(a,b)\in \tau</M> or <M>(b,a)\in \tau</M>, that is, there is essentially a unique minimal presentation (up to arrangement of the components of the pairs in it).
  <ManSection Label="UniqPre">
    <Func Arg="S" Name="IsUniquelyPresentedNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is true if <A>S</A> has uniquely presented. The implementation is based on (see <Cite Key="GS-O"></Cite>).
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);;
      gap> IsUniquelyPresentedNumericalSemigroup(s);
      true
      ]]>
      </Example>          
      
    </Description>
  </ManSection>

  <ManSection Label="Generic">
    <Func Arg="S" Name="IsGenericNumericalSemigroup"></Func>
    <Description>
      <A>S</A> is a numerical semigroup.
      <P/>
      The output is true if <A>S</A> has a generic presentation, that is, in every minimal relation all generators occur. These semigroups are uniquely presented  (see <Cite Key="B-GS-G"></Cite>).
      <Example><![CDATA[
      gap> s:=NumericalSemigroup(3,5,7);;
      gap> IsGenericNumericalSemigroup(s);
      true
      ]]>
      </Example>                                                  
    </Description>
  </ManSection>
</Section>

